[
  {
    "_id": "RS101",
    "name": "Fundementals Computer Science 1",
    "number": "RS4550",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 4,
    "description": "Introduces the fundamental ideas of computing and the principles of programming. Discusses a systematic approach to word problems, including analytic reading, synthesis, goal setting, planning, plan execution, and testing. Presents several models of computing, starting from nothing more than expression evaluation in the spirit of high school algebra. "
  },
  {
    "_id": "RS102",
    "name": "Fundementals Computer Science 2",
    "number": "RS4560",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 3,
    "description": "Continues CS 2500. Examines object-oriented programming and associated algorithms using more complex data structures as the focus. Discusses nested structures and nonlinear structures including hash tables, trees, and graphs. Emphasizes abstraction, encapsulation, inheritance, polymorphism, recursion, and object-oriented design patterns. "
  },
  {
    "_id": "RS103",
    "name": "Database Design",
    "number": "RS4570",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D123",
    "credits": 4,
    "description": "Studies the design of a database for use in a relational database management system. The entity-relationship model and normalization are used in problems. Relational algebra and then the SQL (structured query language) are presented. Advanced topics include triggers, stored procedures, indexing, elementary query optimization, and fundamentals of concurrency and recovery. "
  },
  {
    "_id": "RS104",
    "name": "Computer Systems",
    "number": "CH1230",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "Introduces the basic design of computing systems, computer operating systems, and assembly language using a RISC architecture. Describes caches and virtual memory. Covers the interface between assembly language and high-level languages, including call frames and pointers. Covers the use of system calls and systems programming to show the interaction with the operating system."
  },
  {
    "_id": "RS105",
    "name": "Website Development",
    "number": "CH1240",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "Discusses Web development for sites that are dynamic, data driven, and interactive. Focuses on the software development issues of integrating multiple languages, assorted data technologies, and Web interaction. Considers ASP.NET, C#, HTTP, HTML, CSS, XML, XSLT, JavaScript, AJAX, RSS/Atom, SQL, and Web services. Requires each student to deploy individually designed Web experiments that illustrate the Web technologies and at least one major integrative Web site project. Students may work as a team with the permission of the instructor. "
  },
  {
    "_id": "RS106",
    "name": "Object Oreinted Design",
    "number": "CH1250",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "D134",
    "credits": 3,
    "description": "Presents a comparative approach to object-oriented programming and design. Discusses the concepts of object, class, meta-class, message, method, inheritance, and genericity. Reviews forms of polymorphism in object-oriented languages. Contrasts the use of inheritance and composition as dual techniques for software reuse: forwarding vs. delegation and subclassing vs. subtyping. Fosters a deeper understanding of the principles of object-oriented programming and design including software components, object-oriented design patterns, and the use of graphical design notations such as UML (unified modeling language). "
  },
  {
    "_id": "RS107",
    "name": "Algorithms and Design",
    "number": "ME101",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Languages",
    "credits": 3,
    "description": "Introduces the basic principles and techniques for the design, analysis, and implementation of efficient algorithms and data representations. Discusses asymptotic analysis and formal methods for establishing the correctness of algorithms. Considers divide-and-conquer algorithms, graph traversal algorithms, and optimization techniques. Introduces information theory and covers the fundamental structures for representing data. Examines flat and hierarchical representations, dynamic data representations, and data compression. ",
    "author": "654f9ec2ea7ead465908d1e3"
  },
  {
    "_id": "RS108",
    "name": "Discrete Structures",
    "number": "ME102",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Political Studies",
    "credits": 4,
    "description": "Introduces the mathematical structures and methods that form the foundation of computer science. Studies structures such as sets, tuples, sequences, lists, trees, and graphs. Discusses functions, relations, ordering, and equivalence relations. Examines inductive and recursive definitions of structures and functions. Discusses principles of proof such as truth tables, inductive proof, and basic logic.",
    "author": "654f9ec2ea7ead465908d1e3"
  }
]